dongchao980612/STM32ProjectByJDK/3-4 按键控制LED/Hardware/Led.c
#include "stm32f10x.h"                  // Device header
#include "led.h"


static LedCfg_t g_ledCfg0 =
{
    /* Led0 */
    GPIOB,
    RCC_APB2Periph_GPIOB,
    GPIO_Pin_5
};

static LedCfg_t g_ledCfg1 =
{
    /* Led1 */
    GPIOE,
    RCC_APB2Periph_GPIOE,
    GPIO_Pin_5
};

void Led0_Init(void)
{
    RCC_APB2PeriphClockCmd(g_ledCfg0.ledClock, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;

    GPIO_InitStructure.GPIO_Pin =  g_ledCfg0.ledPin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(g_ledCfg0.ledPort, &GPIO_InitStructure);

    GPIO_SetBits(g_ledCfg0.ledPort, g_ledCfg0.ledPin);
}

void Led0_Turn()
{
    if(GPIO_ReadOutputDataBit(g_ledCfg0.ledPort, g_ledCfg0.ledPin) == LEDMode_ON)
    {
        Led0_Off();
    }
    else
    {
        Led0_On();
    }
}

void Led0_On(void)
{
    GPIO_ResetBits(g_ledCfg0.ledPort, g_ledCfg0.ledPin);
}

void Led0_Off(void)
{
    GPIO_SetBits(g_ledCfg0.ledPort, g_ledCfg0.ledPin);
}





void Led1_Init(void)
{
    RCC_APB2PeriphClockCmd(g_ledCfg1.ledClock, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;

    GPIO_InitStructure.GPIO_Pin =  g_ledCfg0.ledPin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(g_ledCfg1.ledPort, &GPIO_InitStructure);

    GPIO_SetBits(g_ledCfg1.ledPort, g_ledCfg1.ledPin);
}

void Led1_Turn()
{
    if(GPIO_ReadOutputDataBit(g_ledCfg1.ledPort, g_ledCfg1.ledPin) == LEDMode_ON)
    {
        Led1_Off();
    }
    else
    {
        Led1_On();
    }
}

void Led1_On(void)
{
    GPIO_ResetBits(g_ledCfg1.ledPort, g_ledCfg1.ledPin);
}

void Led1_Off(void)
{
    GPIO_SetBits(g_ledCfg1.ledPort, g_ledCfg1.ledPin);
}
